In [147]:
import pandas as pd
import sqlite3

import csv file

In [148]:
df1 = pd.read_csv('assessments.csv')
df2 = pd.read_csv('courses.csv')
df3 = pd.read_csv('studentInfo.csv')
df4 = pd.read_csv('studentRegistration.csv')
df5 = pd.read_csv('vle.csv')
df6 = pd.read_csv('studentAssessment.csv')

create connection

In [149]:
conn = sqlite3.connect('ungradedtest.db', timeout=30)

create cursor

In [150]:
curr = conn.cursor()

create DROP function

In [151]:
def dropTable(table):
    curr.execute(f'''
        DROP TABLE {table}
    ''')
    conn.commit()

knowing df1.info()

In [152]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206 entries, 0 to 205
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   code_module        206 non-null    object
 1   code_presentation  206 non-null    object
 2   id_assessment      206 non-null    int64
 3   assessment_type    206 non-null    object
 4   date               195 non-null    float64
 5   weight             206 non-null    float64
dtypes: float64(2), int64(1), object(3)
memory usage: 9.8+ KB

change int datatype to float data type

In [153]:
df1['id_assessment'] = df1['id_assessment'].astype(float)

In [154]:
dropTable('assessment')

creating assessment table

In [155]:
curr.execute('''
    CREATE TABLE assessment(
        code_module varchar(50),
        code_presentation varchar(50),
        id_assessment INT PRIMARY KEY,
        assessment_type varchar(50),
        date date,
        weight FLOAT
    );'''
)

INSERTING all values from csv file

In [156]:
for i in range(len(df1)):
    curr.execute('''
    INSERT INTO assessment (code_module, code_presentation, id_assessment, assessment_type, date, weight)
    VALUES (?,?,?,?,?,?)''', (df1['code_module'][i],
    df1['code_presentation'][i],
    df1['id_assessment'][i],
    df1['assessment_type'][i],
    df1['date'][i],
    df1['weight'][i]))
    conn.commit()

df2 info

In [157]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   code_module                 22 non-null     object
 1   code_presentation           22 non-null     object
 2   module_presentation_length  22 non-null     int64
dtypes: int64(1), object(2)
memory usage: 656.0+ bytes

mengganti int64 to float

In [158]:
df2['module_presentation_length'] = df2['module_presentation_length'].astype(float)

In [159]:
dropTable('courses')

create courses TABLE

In [160]:
curr.execute('''
    CREATE TABLE courses(
        code_module varchar(50),
        code_presentation varchar(50),
        module_presentation_lenght INT
    );'''
)

INSERTING courses values from csv

In [161]:
for i in range(len(df2)):
    curr.execute('''
    INSERT INTO courses (code_module, code_presentation, module_presentation_lenght)
    VALUES (?,?,?)''', 
    (df2['code_module'][i],
    df2['code_presentation'][i],
    df2['module_presentation_length'][i]))
    conn.commit()

df3 info

In [162]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   code_module           32593 non-null  object
 1   code_presentation     32593 non-null  object
 2   id_student            32593 non-null  int64
 3   gender                32593 non-null  object
 4   region                32593 non-null  object
 5   highest_education     32593 non-null  object
 6   imd_band              31482 non-null  object
 7   age_band              32593 non-null  object
 8   num_of_prev_attempts  32593 non-null  int64
 9   studied_credits       32593 non-null  int64
 10  disability            32593 non-null  object
 11  final_result          32593 non-null  object
dtypes: int64(3), object(9)
memory usage: 3.0+ MB

change all INT datatype to float

In [163]:
df3['id_student'] = df3['id_student'].astype(float)
df3['num_of_prev_attempts'] = df3['num_of_prev_attempts'].astype(float)
df3['studied_credits'] = df3['studied_credits'].astype(float)

In [164]:
dropTable('studentInfo')

creating TABLE studentInfo

In [165]:
curr.execute('''
    CREATE TABLE studentInfo(
        code_module varchar(50),
        code_presentation varchar(50),
        id_student INT,
        gender varchar(50),
        region varchar(50),
        highest_education varchar(50),
        imd_band varchar(50),
        age_band varchar(50),
        num_of_prev_attempts INT,
        studied_credits INT,
        disability varchat(50),
        final_result varchar(50)
    )
''')

INSERTING all valeus from CSV

In [166]:

for i in range(len(df3)):
    curr.execute('''
        INSERT INTO studentInfo (code_module, code_presentation, id_student, gender, region, highest_education, imd_band, age_band, num_of_prev_attempts, studied_credits, disability, final_result)
        VALUES (?,?,?,?,?,?,?,?,?,?,?,?)''',(
            df3['code_module'][i],
            df3['code_presentation'][i],
            df3['id_student'][i],
            df3['gender'][i],
            df3['region'][i],
            df3['highest_education'][i],
            df3['imd_band'][i],
            df3['age_band'][i],
            df3['num_of_prev_attempts'][i],
            df3['studied_credits'][i],
            df3['disability'][i],
            df3['final_result'][i]
        ))
    conn.commit()

df4 INFO

In [167]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   code_module          32593 non-null  object
 1   code_presentation    32593 non-null  object
 2   id_student           32593 non-null  int64
 3   date_registration    32548 non-null  float64
 4   date_unregistration  10072 non-null  float64
dtypes: float64(2), int64(1), object(2)
memory usage: 1.2+ MB

change int datatype to float

In [168]:
df4['id_student'] = df4['id_student'].astype(float)

In [169]:
dropTable('student_registration')

creating student_registration table

In [170]:
curr.execute('''
    CREATE TABLE student_registration(
        code_module varchar(50),
        code_presentation varchar(50),
        id_student INT,
        date_registration FLOAT,
        date_unregistration FLOAT
    );
''')

inserting all valeus from csv

In [171]:
for i in range(len(df4)):
    curr.execute('''
        INSERT INTO student_registration (code_module, code_presentation, id_student, date_registration, date_unregistration)
        VALUES (?,?,?,?,?)''', (
            df4['code_module'][i],
            df4['code_presentation'][i],
            df4['id_student'][i],
            df4['date_registration'][i],
            df4['date_unregistration'][i]
        )
    )
    conn.commit()

df5 info

In [172]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6364 entries, 0 to 6363
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id_site            6364 non-null   int64
 1   code_module        6364 non-null   object
 2   code_presentation  6364 non-null   object
 3   activity_type      6364 non-null   object
 4   week_from          1121 non-null   float64
 5   week_to            1121 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 298.4+ KB

change int datatype to float

In [173]:
df5['id_site'] = df5['id_site'].astype(float)

In [174]:
dropTable('vle')

creating vle table

In [175]:
curr.execute('''
    CREATE TABLE vle(
        id_site INT,
        code_module varchar(50),
        code_presentation varchar(50),
        activity_type varchar(50),
        week_from INT,
        week_to INT
    )
''')

inserting all values from csv

In [176]:
for i in range(len(df5)):
    curr.execute('''
        INSERT INTO vle (id_site, code_module, code_presentation, activity_type, week_from, week_to)
        VALUES (?,?,?,?,?,?)''',
        (df5['id_site'][i],
        df5['code_module'][i],
        df5['code_presentation'][i],
        df5['activity_type'][i],
        df5['week_from'][i],
        df5['week_to'][i]
        ))
    conn.commit()

df6 info

In [177]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173912 entries, 0 to 173911
Data columns (total 5 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id_assessment   173912 non-null  int64
 1   id_student      173912 non-null  int64
 2   date_submitted  173912 non-null  int64
 3   is_banked       173912 non-null  int64
 4   score           173739 non-null  float64
dtypes: float64(1), int64(4)
memory usage: 6.6 MB

change all int datatype to float

In [178]:
df6['id_assessment'] = df6['id_assessment'].astype(float)
df6['id_student'] = df6['id_student'].astype(float)
df6['date_submitted'] = df6['date_submitted'].astype(float)
df6['is_banked'] = df6['is_banked'].astype(float)

In [179]:
dropTable('studentAssessment')

creating studentAssessment table

In [180]:
curr.execute('''
    CREATE TABLE studentAssessment(
        id_assessment INT,
        id_student INT,
        date_submitted INT(50),
        is_banked INT(50),
        score INT
    )
''')

insert all values from csv

In [181]:
for i in range(len(df6)):   
    curr.execute('''
        INSERT INTO studentAssessment(id_assessment,  id_student, date_submitted, is_banked,score)
        VALUES (?,?,?,?,?)''',(
            df6['id_assessment'][i],
            df6['id_student'][i],
            df6['date_submitted'][i],
            df6['is_banked'][i],
            df6['score'][i]
        )
    )
    conn.commit()

select and join all the objectives ask to new variable final_query

In [182]:
final_query = curr.execute('''
    SELECT studentInfo.id_student, studentInfo.region, studentInfo.code_module,  a.assessment_type , studentAssessment.score
    FROM studentInfo
    JOIN studentAssessment
    ON studentInfo.Id_student = studentAssessment.id_student
    JOIN assessment a 
    ON studentAssessment.id_assessment = a.id_assessment
    WHERE studentInfo.code_presentation = '2014B'
''')

creating datafram to read it on pandas dataframe

In [183]:
df_final = pd.DataFrame(final_query, columns=[
    'id_student',
    'region',
    'code_module',
    'assessment_type',
    'score'])

In [184]:
df_final

       id_student               region code_module assessment_type  score
0          295741    South East Region         FFF             TMA   38.0
1          295741    South East Region         FFF             TMA   52.0
2          295741    South East Region         FFF             TMA   52.0
3          295741    South East Region         FFF             TMA   54.0
4          295741    South East Region         FFF             TMA   55.0
...           ...                  ...         ...             ...    ...
49987      624767        London Region         GGG             CMA  100.0
49988      627812     Yorkshire Region         GGG             CMA   80.0
49989      631446  East Anglian Region         GGG             CMA  100.0
49990      624767        London Region         GGG             CMA  100.0
49991      631446  East Anglian Region         GGG             CMA  100.0

[49992 rows x 5 columns]